In [23]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("taxa.db3")
df1 = pd.read_sql_query("select * from name;", conn)

In [24]:
df1.head()

   id  tax_id         name       name_class
0   1       1          all          synonym
1   2       1         root  scientific name
2   3       2     Bacteria  scientific name
3   4       2       Monera          in-part
4   5       2  Procaryotae          in-part

In [15]:
df1.name_class.unique()

array(['synonym', 'scientific name', 'in-part', 'blast name',
       'genbank common name', 'equivalent name', 'includes',
       'misspelling', 'common name', 'authority', 'misnomer',
       'genbank synonym', 'anamorph', 'genbank anamorph', 'teleomorph',
       'acronym', 'genbank acronym', 'unpublished name'], dtype=object)

In [16]:
df1.shape

(472360, 4)

In [22]:
df1.tax_id.nunique()

331439

In [17]:
conn = sqlite3.connect("taxa.db3")
df2 = pd.read_sql_query("select * from taxonomy;", conn)

In [18]:
df2.head()

   tax_id           scientific_name          rank  parent_id
0       1                      root       no rank          1
1       2                  Bacteria  superkingdom     131567
2       6              Azorhizobium         genus     335928
3       7  Azorhizobium caulinodans       species          6
4       9       Buchnera aphidicola       species      32199

In [19]:
df2.shape

(331439, 4)

In [21]:
df2.tax_id.nunique()

331439